In [17]:
import pandas as pd

In [18]:
titanic_df = pd.read_csv("titanic.csv")
titanic_df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [19]:
titanic_df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Embarked","Cabin"], axis=1, inplace=True)
titanic_df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [20]:
target = titanic_df.Survived
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [21]:
inputs = titanic_df.drop(["Survived"], axis = 1)
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [22]:
dummies = pd.get_dummies(titanic_df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [23]:
titanic_df = pd.concat([titanic_df,dummies], axis=1)
titanic_df.drop(["Sex"],axis=1, inplace=True)
titanic_df

     Pclass   Age     Fare  Survived  female  male
0         3  22.0   7.2500         0       0     1
1         1  38.0  71.2833         1       1     0
2         3  26.0   7.9250         1       1     0
3         1  35.0  53.1000         1       1     0
4         3  35.0   8.0500         0       0     1
..      ...   ...      ...       ...     ...   ...
886       2  27.0  13.0000         0       0     1
887       1  19.0  30.0000         1       1     0
888       3   NaN  23.4500         0       1     0
889       1  26.0  30.0000         1       0     1
890       3  32.0   7.7500         0       0     1

[891 rows x 6 columns]

In [24]:
titanic_df.columns[titanic_df.isna().any()]

Index(['Age'], dtype='object')

In [25]:
titanic_df.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [26]:
titanic_df.Age = titanic_df.Age.fillna(round(titanic_df.Age.mean()))
titanic_df.head(6)

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0
3       1  35.0  53.1000         1       1     0
4       3  35.0   8.0500         0       0     1
5       3  30.0   8.4583         0       0     1

In [27]:
x = titanic_df.drop("Survived", axis=1)
y = target

In [67]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.2)

In [68]:
print(X_train.shape,y_train.shape,X_test.shape,y_test.shape)

(712, 5) (712,) (179, 5) (179,)

In [69]:
from sklearn.naive_bayes import GaussianNB
nb = GaussianNB()

In [70]:
nb.fit(X_train,y_train)

GaussianNB()

In [71]:
nb.score(X_test,y_test)

0.7541899441340782

In [72]:
X_test[:10]

     Pclass   Age      Fare  female  male
705       2  39.0   26.0000       0     1
625       1  61.0   32.3208       0     1
540       1  36.0   71.0000       1     0
337       1  41.0  134.5000       1     0
570       2  62.0   10.5000       0     1
163       3  17.0    8.6625       0     1
791       2  16.0   26.0000       0     1
640       3  20.0    7.8542       0     1
738       3  30.0    7.8958       0     1
15        2  55.0   16.0000       1     0

In [73]:
y_test[:10]

705    0
625    0
540    1
337    1
570    1
163    0
791    0
640    0
738    0
15     1
Name: Survived, dtype: int64

In [74]:
nb.predict(X_test[:10])

array([0, 0, 1, 1, 0, 0, 0, 0, 0, 1], dtype=int64)

In [75]:
nb.predict_proba(X_test[:10])

array([[9.81172570e-01, 1.88274298e-02],
       [8.66475909e-01, 1.33524091e-01],
       [1.60909031e-03, 9.98390910e-01],
       [3.03217676e-06, 9.99996968e-01],
       [9.70755098e-01, 2.92449022e-02],
       [9.90181006e-01, 9.81899390e-03],
       [9.75514718e-01, 2.44852819e-02],
       [9.90838966e-01, 9.16103415e-03],
       [9.92139139e-01, 7.86086117e-03],
       [3.13518720e-02, 9.68648128e-01]])